fmy_rails_project/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 1], ["LIMIT", 1]]
---
    def index
        # debugger
      @artworks = Artwork.find_by(artist_id: params[:user_id])

DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]
---
    def destroy
      artwork_destroy = Artwork.destroy(params[:id])