fmy_rails_project/app/controllers/artworks_controller.rb

    def index
      @atrworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"