fmy_rails_project/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1 LIMIT $2  [["author_id", 3], ["LIMIT", 1]]
---
    def index
        # debugger
        if params[:user_id].nil?
            @comments = Comment.find_by(artwork_id: params[:artwork_id])
        elsif params[:artwork_id].nil?
            @comments = Comment.find_by(author_id: params[:user_id])

INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "this painting is booty"], ["author_id", 2], ["artwork_id", 3], ["created_at", "2022-10-20 21:20:15.028147"], ["updated_at", "2022-10-20 21:20:15.028147"]]
---
    def create
        params[:comment][:artwork_id] = params[:artwork_id]
        # debugger
        comment = Comment.new(comment_params)
      if comment.save