fmy_rails_project/app/controllers/users_controller.rb

  def index
    @users = CreateUsers.all
---
SELECT "create_users".* FROM "create_users"

  def create
    user = CreateUsers.new(user_params)
    if user.save
---
INSERT INTO "create_users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-10-20 15:59:48.279847"], ["updated_at", "2022-10-20 15:59:48.279847"], ["username", "John"]]

  def show
    user = CreateUsers.find(params[:id])
---
SELECT "create_users".* FROM "create_users" WHERE "create_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    user = CreateUsers.find(params[:id])

    if user.update(user_params)
---
SELECT "create_users".* FROM "create_users" WHERE "create_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "create_users" SET "updated_at" = $1, "username" = $2 WHERE "create_users"."id" = $3  [["updated_at", "2022-10-20 20:07:23.205413"], ["username", "Winniethepooh"], ["id", 2]]

  def destroy
    user_destroy = CreateUsers.destroy(params[:id])
---
DELETE FROM "create_users" WHERE "create_users"."id" = $1  [["id", 3]]